<template>
  <svg v-if="showPaswordTag" width="32" height="32" viewBox="0 0 32 32">
    <g id="组_7593" data-name="组 7593" transform="translate(-1201 -248)">
      <rect id="矩形_5253" data-targetpasswd="矩形 5253" width="32" height="32" transform="translate(1201 248)" fill="#fff"
        opacity="0" />
      <g id="hide" transform="translate(1108.203 -51.974)">
        <path id="路径_1734" data-name="路径 1734"
          d="M119.244,310.37a.925.925,0,0,1,1.3,1.312,15.871,15.871,0,0,1-23.5,0,.925.925,0,0,1,1.3-1.312,14.033,14.033,0,0,0,20.894,0Z"
          transform="translate(0)" />
        <path id="路径_1735" data-name="路径 1735"
          d="M136.532,437.7a.925.925,0,0,0-1.4,1.2l.09.1,3.1,3.1a.925.925,0,0,0,1.4-1.2l-.09-.1Zm-16.1,0a.925.925,0,0,1,1.4,1.2l-.09.1-3.093,3.093a.925.925,0,0,1-1.4-1.2l.09-.1Z"
          transform="translate(-19.683 -123.632)" />
        <path id="路径_1736" data-name="路径 1736"
          d="M353.2,480.405a.925.925,0,0,1,1.818.326l-.022.123-1.233,4.932a.925.925,0,0,1-1.818-.326l.022-.123Zm6.728,0a.925.925,0,0,0-1.818.326l.022.123,1.233,4.932a.925.925,0,0,0,1.818-.326l-.022-.123Z"
          transform="translate(-247.771 -164.671)" />
      </g>
    </g>
  </svg>
  <svg v-else xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32">
    <g id="组_7594" data-name="组 7594" transform="translate(-1201 -248)">
      <rect id="矩形_5253" data-targetpasswd="矩形 5253" width="32" height="32" transform="translate(1201 248)" fill="#fff"
        opacity="0" />
      <g id="show" transform="translate(1194.283 116.163)">
        <path id="路径_1737" data-name="路径 1737"
          d="M22.718,157.161a11.681,11.681,0,0,1-8.369-3.335,15.5,15.5,0,0,1-3.479-5.193,2.053,2.053,0,0,1,.024-1.62c1.12-2.46,4.5-8.175,11.752-8.175S33.367,144.546,34.523,147a2.03,2.03,0,0,1,.037,1.65,15.478,15.478,0,0,1-3.479,5.185A11.68,11.68,0,0,1,22.718,157.161Zm-.071-16.8c-6.368,0-9.368,5.092-10.359,7.276a.518.518,0,0,0-.005.407c.943,2.283,3.847,7.59,10.436,7.59s9.487-5.3,10.43-7.574a.5.5,0,0,0-.008-.407c-1.032-2.193-4.118-7.289-10.493-7.289Z"
          transform="translate(0)" />
        <path id="路径_1738" data-name="路径 1738"
          d="M336.446,341.291a4.328,4.328,0,1,1-4.328,4.328A4.328,4.328,0,0,1,336.446,341.291Zm0,7.128a2.8,2.8,0,1,0-2.8-2.8A2.8,2.8,0,0,0,336.446,348.419Z"
          transform="translate(-313.731 -197.622)" />
      </g>
    </g>
  </svg>
</template>

<script setup lang="ts">
const props = defineProps<{ showPaswordTag: Boolean }>()
const props2 = defineProps()
</script>
